import styled from "styled-components";

function PromotionText() {
  return (
    <Layout>
      안녕하세요! 카공 및 친목 동아리 ABOUT입니다!
      <br />
      공부를 목적으로 하시는 분도, 카공과 함께 동네 친구를 만들고 싶은 분들도 모두 환영해요!😊{" "}
      <br />
      <br />
      ☕️동아리 소개☕️
      <br />
      ✔개인 공부에 집중도 할 수 있고, 소소하게 얘기도 할 수 있는 분위기의 스터디
      <br />
      ✔지역별로 장소가 분류되어 있어 쉽게 참여할 수 있는 스터디
      <br />
      ✔원하는 날짜와 시간에 자유롭게 투표하고 참여하는 스터디
      <br />
      ✔같은 지역, 비슷한 또래, 비슷한 전공이나 관심사를 가진 친구를 만날 수 있는 동아리
      <br />
      ✔카공뿐만 아니라 다양한 오프라인 모임도 진행하는 동아리
      <br />
      ✔다양한 동아리 내 컨텐츠와 항시 진행중인 이벤트
      <br />
      ✔체계적으로 관리하고 운영되는 동아리
      <br />
      ✔열심히 공부한 후에 밥 한끼 같이 먹을 수 있는 그런 동아리 !
      <br />
      <br />
      ☕️모임 장소☕️
      <br />
      1. 수원: 아주대/수원역/경희대/수원시청역/상현역/광교역/송죽동/구운동
      <br />
      2. 양천＆영등포: 당산역/오목교역/영등포구청역/등촌역/신도림역/여의도역/까치산역/화곡동
      <br />
      3. 안양: 안양역/인덕원역/범계역/금정역
      <br />
      4. 강남: 강남역/논현역/양재역/선릉역/강남구청역/신논현역/교대역
      <br />
      <br />
      ☕️가입 조건☕️ <br />
      1. 한 달에 최소 1회 이상 카공 스터디에 참여 가능한 인원
      <br />
      2. 만 19~26세의 대학생(졸업생)
      <br />
      3. 불온한 목적의 가입자를 엄격하게 금지함(진짜 가만 안둠)
      <br />
      4. 타인에게 피해나 불쾌감을 주는 행위는 발각시 즉각 추방 !
      <br />
      <br />
      ☕️회비☕️
      <br />
      2000원의 가입비 + 3000원의 보증금(환급 가능)
      <br />
      안양 지역은 가입비/보증금 무료
      <br />
      보증금은 동아리 규칙에 의거하여 100원 ~ 1000원 사이의 벌금이 부여될 수 있습니다.
      <br />
      <br />
      ☕️가입 신청 및 동아리 구경☕️
      <br />
      아래 링크에서 &apos;게스트 로그인&apos;을 통해 구경하거나, <br />
      &apos;카카오 로그인&apos;을 통해 가입 신청이 가능합니다. <br />
      https://studyabout.club
      <br />
      <br />
      ☕️관련문의☕️
      <br />
      https://open.kakao.com/o/sjDgVzmf
      <br />
      ✔저희 동아리는 교내 동아리가 아닌 대학교 연합동아리 입니다.
      <br />
      ✔오픈 지역은 지속적으로 추가 및 확장되고 있어요!
      <br />✔ 혹시하는 마음에 한번 더 언급하자면 신천지아니고, 웹 사이트 상에서의 프로필도 모두
      오픈되어 있어요! 관련해서 문의하지 말아주세요...🥲
    </Layout>
  );
}

const Layout = styled.div`
  font-size: 12px;
`;

export default PromotionText;
