import styled from "styled-components";
export const ACCOUNT = "1002-364-221277 우리은행 이승주(어바웃)";
export const ACCOUNT_SHORT = "1002-364-221277 우리은행 어바웃";

export const REGISTER_AGE_MIN = 12;

export function PromotionComponent() {
  return <P>{PROMOTION_TEXT}</P>;
}

const P = styled.p`
  padding: var(--gap-2);
  border-radius: var(--rounded-lg);
  height: 240px;
  overflow-x: auto;
  overflow-y: auto;
  font-size: 12px;
  background-color: var(--input-bg);
`;

export const OPEN_KAKAO_LINK = "https://open.kakao.com/o/sjDgVzmf";

export const PROMOTION_TEXT = `안녕하세요! 저희는 대학생들의 스터디 & 친목 동아리 ABOUT입니다! 자율적으로 참여하는 카공 스터디와 여러 분야의 그룹 스터디, 다양한 주제의 소모임과 오프라인 모임 등을 통해 또래 친구들을 만나 다양한 활동을 할 수 있는 기회를 제공하는 것을 목표로 하고 있습니다! \n\n *이번 여름 방학에도 관심사 소모임, 여러 스터디, 동아리 MT 등 여러 컨텐츠를 진행합니다. \n\n ☕️ 카공 스터디 ☕️\n\n✔ 개인 공부 + 소소한 대화의 스터디 분위기 \n✔ 원하는 날짜, 시간, 장소에 자율적인 스터디 참여 \n✔ 지역, 또래, 관심사를 공유하는 친구들과 카공 \n✔ 시험 주간에 참여할 수 있는 정기 스터디 \n\n☕️그룹스터디☕️ \n\n✔ 자격증, 어학, 프로그래밍, 취업준비, 자기계발 등 모든 분야 \n✔ 토익, 오픽, 영어회화, 일본어회화, 컴활, 투두메이트, 열품타(공부인증), 습관만들기, 리그오브레전드, 파이썬, C++, 개발 프로젝트, 운동인증, 코딩테스트, 편입 스터디,한국사 등 \n\n☕️ 친목 활동 ☕️\n\n✔ 누구나 자유롭게 올리고 참여할 수 있는 번개 모임 \n✔ 파티룸, MT 등의 정기 모임 \n✔ 나이, 관심사, 희망사항 등을 고려해서 매칭하는 조 모임 등 \n\n☕️기타☕️ \n\n✔ 다양한 오프라인 모임과 이벤트 \n✔ 체계적인 운영과 관리 체계 \n✔ 열심히 공부한 뒤 같이 놀기도 하는 동아리 \n✔ 새로운 친구를 만나고 추억을 쌓을 수 있는 동아리 \n\n✅ 가입 조건 ✅ \n\n✔ 한 달에 최소 1회 이상 카공 스터디 참여 \n✔ 만 19~26세의 대학생(졸업생) \n\n🚨종교/이성 목적 등 불온한 목적의 가입을 엄격히 금지합니다. \n🚨타인에게 피해나 불편함을 주는 행위 발각시 즉시 추방됩니다. \n\n☕️ 모임 장소 ☕️ \n\n- 수원 지역 \n- 안양/과천/군포 지역 (과천/군포 추가 예정) \n- 양천/영등포/마포/서대문 지역 \n- 강남 지역 \n- 동대문/성북구 지역 \n- 인천 지역 \n- 성남 지역 (준비중, 신청 가능) \n\n!!스터디 지역은 계속 확장되는 중입니다!! \n\n☕️ 회비 ☕️\n 가입비: 2000원 보증금: 3000원 (탈퇴시 환급) \n\n📝 가입 신청 및 동아리 구경 📝 \nhttp://study-about.club \n\n가입 신청: '카카오 로그인' \n동아리 구경: '게스트 로그인' \n\n✔ 웹사이트 뿐만 아니라 동아리를 위한 어플도 만들어져 있습니다. \n\n✔ 저희는 교내 동아리가 아닌 대학교 연합동아리입니다. \n✔ 오픈 지역은 지속적으로 추가 및 확장 중에 있습니다. \n✔ 특정 종교, 정치, 시민 단체와 전혀 관련 없는 건전한 연합동아리로, 다양한 관심사와 배움을 추구하는 대학생들을 환영합니다. 동아리 관련 문의는 링크를 통해 해주세요.\n\n https://open.kakao.com/o/sjDgVzmf `;
