import styled from "styled-components";
export const ACCOUNT = "1002-364-221277 우리은행 이승주(어바웃)";
export const ACCOUNT_SHORT = "1002-364-221277 우리은행 어바웃";

export const REGISTER_AGE_MIN = 12;

export function PromotionComponent() {
  return <P>{PROMOTION_TEXT}</P>;
}

const P = styled.p`
  padding: var(--gap-2);
  border-radius: var(--rounded-lg);
  height: 240px;
  overflow-x: auto;
  overflow-y: auto;
  font-size: 12px;
  background-color: var(--input-bg);
`;

export const OPEN_KAKAO_LINK = "https://open.kakao.com/o/sjDgVzmf";

export const PROMOTION_TITLE = `✨동아리 하나로 스터디부터 취미, 소모임, 번개까지⁉️ 수도권 대학생 연합 동아리 ABOUT에서 하고 싶은 거 다 하자‼️`;

export const PROMOTION_TEXT = `공부, 취미, 친구 모두 다 챙기면서 의미있는 대학생활을 보내고 싶다면, 저희 동아리에서 함께해요!\n\n🔥 동아리 소개 🔥\nABOUT은 대학생을 위한 스터디 동아리입니다! 현재 총 400명 이상의 회원이 지역별로 활동하고 있기 때문에 근처에 사는 또래 친구들과 스터디와 다양한 활동이 가능합니다. 2022년 개설 이후로 2000명 이상의 회원이 참여했고, 1000회 이상의 카공 스터디가 열렸으며, 200회 이상의 번개 모임과 40여개의 취미/관심사 소모임이 지금까지 활발히 운영되고 있습니다!\n\n💘공부는 해야 하는데 집에서 뒹굴거리고 있는 당신! 스터디를 할까 해도 날짜, 장소, 시간을 계획하기 어려워 포기하진 않았나요?\n\n💘익명의 누군가와 스터디를 하는 게 부담감이 느껴지진 않았나요?\n\n💘운영 관리가 되지 않아 당일 파토가 나고, 유령 모임이 되어버리진 않았나요?\n\n💘친구도 사귀고 다양한 활동도 하고 싶은데, 무작정 술 먹고 노는 것보단 공부도 하고 의미있는 대학생활을 보내고 싶진 않나요?\n\n가입만 하세요! 공부부터 취미, 친구 사귀기까지 이 모든 걸 책임져 드리겠습니다😎\n\n📚 스터디 활동\n1. 카공 스터디\n동네 친구들과 함께 공부할 수 있는 카공 스터디입니다. 언제든 원하는 날짜와 장소로 참여할 수 있어요!\n\n2. 정기 스터디\n시험기간에는 각 잡고 하루 종일 공부하는 스터디가 열립니다. 열심히 공부하는 친구들과 함께라면 밤샘도 두렵지 않아...💫\n\n3. 온라인 스터디(캠 스터디, 공부 인증)\n오프라인 스터디가 어려운 날에는 온라인 스터디에서 같이 공부해요!\n\n🙌🏻 다양한 소모임\n동아리 내에서 같은 관심사나 목적을 가진 친구들끼리 그룹을 만들어 원하는 공부나 취미 활동을 함께 진행할 수 있습니다.\n\n1. 공부 소모임:\n영어 회화, 자격증 준비, 프로그래밍 같은 학습 중심 소모임\n\n2. 자기계발 소모임:\n운동 인증, 습관 만들기 등 자기 성장에 집중할 수 있는 소모임\n\n3. 취미 소모임\n보드게임, 전시회 관람, 방탈출 등 취미를 공유할 수 있는 소모임\n\n😆 즐거운 친목 활동\n1. 자유롭게 열리는 번개 모임\n내 마음대로 여는 번개 모임! 시간과 조건을 설정해 원하는 친구들과 만날 수 있습니다. 부담 없이 참여해보세요.\n\n2. 파티룸, OT, MT 등 다양한 행사\n운영진이 다 준비할게요! 그냥 와서 놀기만 하세요. 나이, 성별, 지역 등을 고려한 사전 조편성으로 어색하지 않게 즐길 수 있어요!\n\n3. 또래 친구들과 함께하는 조모임\n같은 지역 또래 친구들과 조를 매칭해 만나는 모임입니다. 처음이라고 걱정하지 마세요! 새로운 친구들과 금방 친해질 수 있어요.\n\n📝 가입 조건\n만 19~26세의 대학생(졸업생 포함)\n✔ 근처에 사는 친구들과 스터디나 관심사를 공유하고 싶은 사람\n✔ 친목뿐만 아니라 더 의미 있는 대학생활을 원하는 사람\n✔ 하고 싶은 건 많은데 동아리 여러 개 들어가고 싶진 않은 사람\n✔ 파토 안 나고 잘 만나는 동아리에서 활동하고 싶은 사람\n\n모두 환영합니다🤗\n\n🚨 주의 사항\n이성/종교 목적 등 불온한 가입은 엄격히 금지되며, 타인에게 불편을 주는 인원은 즉시 추방됩니다.\n\n🎯 지금 바로 가입하고 스터디 시작하기!\n\n👇 가입 신청 및 동아리 구경 👇\nhttp://study-about.club\n\n 🐾 궁금한 점이 있다면? 바로 문의해주세요~\nhttps://open.kakao.com/o/sjDgVzmf`;
