export const MBTI = [
  "ISTJ",
  "ISFJ",
  "INFJ",
  "INTJ",
  "ISTP",
  "ISFP",
  "INFP",
  "INTP",
  "ESTP",
  "ESFP",
  "ENFP",
  "ENTP",
  "ESTJ",
  "ESFJ",
  "ENFJ",
  "ENTJ",
  "생략",
];

export const MAJORS_DATA = [
  {
    department: "인문계열",
    details: ["국어/국문학", "영어/영문학", "기타 외국어/문학", "인문과학"],
  },
  {
    department: "사회계열",
    details: ["경영/경제", "법률", "사회과학", "기타"],
  },
  {
    department: "교육계열",
    details: ["교육일반", "유아교육", "특수교육", "초등교육", "중등교육"],
  },
  {
    department: "공학계열",
    details: [
      "건축",
      "토목/도시",
      "교통/운송",
      "기계/금속",
      "전기/전자",
      "정밀/에너지",
      "소재/재료",
      "컴퓨터/통신",
      "산업",
      "화공",
      "기타",
    ],
  },
  {
    department: "자연계열",
    details: ["농림/수산", "생물/화학/환경", "생활과학", "수학/물리", "천문/지리"],
  },
  {
    department: "의약계열",
    details: ["의료", "간호", "약학", "치료/보건", "기타"],
  },
  {
    department: "예체능계열",
    details: ["디자인", "응용예술", "무용/체육", "미술/조형", "연극/영화", "음악", "기타"],
  },
];

export const INTEREST_DATA = [
  "학교공부",
  "코딩",
  "디자인",
  "블로그포스팅",
  "영어자격증",
  "국가자격증",
  "독서",
  "다이어리",
  "콘텐츠감상",
  "직장업무",
  "취업준비",
  "자기계발",
  "등",
];

export const MESSAGE_DATA = [
  "반가워요! 잘 부탁드립니다ㅎㅎ",
  "이제 막 들어왔어요! 잘 부탁드립니다!",
  "편하게 말 걸어주세요, 잘 부탁드려요!",
  "다들 만나서 반가워요!",
  "안녕하세요! 잘 부탁드립니다 :)",
  "같이 스터디할 사람 환영!",
  "열심히 하겠습니당☺",
  "말 걸면 90% 확률로 답해요",
  "활동 같이 하면서 친해져요!",
  "조용한데 말 걸면 잘 받아줘요",
  "다 같이 재밌게 놀아봐요!",
  "참여 열심히 하겠습니다ㅎㅎ",
  "새로운 사람 만나는 거 좋아해요",
];
